import streamlit as st  # 导入Streamlit并用st代表它
import pandas as pd
import numpy as np

st.set_page_config(page_title='南宁美食地图')

st.title('🍔南宁美食探索')
st.text('探索广西南宁最受欢迎的美食地点！选择你感兴趣的餐厅类型，查看评分和位置。')

st.header('📍南宁美食地图')

#创建简单的地图
st.map(pd.DataFrame({
    "latitude":[22.812163 , 22.812163 , 22.813661 , 22.813661 , 22.813661],   
    "longitude":[108.392937 , 108.392937 , 108.383764 , 108.383764 , 108.383764],
    "餐厅": ["大头椰·椰子鸡火锅", "青和居酒屋", "达美乐比萨", "德意客意式餐厅·生日聚会", "Myway咖啡·小食光"]
}))


st.header('⭐餐厅评分')
data = {
    '店铺名称':["大头椰·椰子鸡火锅", "青和居酒屋", "达美乐比萨", "德意客意式餐厅·生日聚会", "Myway咖啡·小食光"],
    '大头椰·椰子鸡火锅':[4.9],
    '青和居酒屋':[4.5],
    '达美乐比萨':[5.0],
    '德意客意式餐厅·生日聚会':[4.8],
    'Myway咖啡·小食光':[4.1]
}
# 根据上面创建的data，创建数据框
df = pd.DataFrame(data)
# 定义数据框所用的新索引
index = pd.Series([1,2,3,4,5], name='序号')
# 将新索引应用到数据框上
df.index = index
st.subheader("设置x参数")
# 通过x指定店铺名称所在这一列为条形图的x轴
st.bar_chart(df, x='店铺名称')
# 修改df，用店铺名称列作为df的索引，替换原有的索引
df.set_index('店铺名称', inplace=True)
st.subheader("设置y参数")
st.bar_chart(df, y=["大头椰·椰子鸡火锅", "青和居酒屋", "达美乐比萨", "德意客意式餐厅·生日聚会", "Myway咖啡·小食光"])
# 通过width、height和use_container_width指定条形图的宽度和高度
st.bar_chart(df, width=400, height=300, use_container_width=False)

st.header('💰不同类型餐厅价格')







# 餐厅数据
restaurants = pd.DataFrame({
    "餐厅": ["大头椰·椰子鸡火锅", "青和居酒屋", "达美乐比萨", "德意客意式餐厅·生日聚会", "Myway咖啡·小食光"],
    "类型": ["中餐", "日式", "西餐", "西餐", "西餐"],
    "评分": [4.9, 4.5, 5.0, 4.8, 4.1],
    "人均消费(元)": [83, 59, 53, 54, 57],
    "位置X": [22.812163,22.812163,22.813661,22.813661,22.813661],
    "位置Y": [108.392937,108.392937,108.383764,108.383764,108.383764]
})
